/**
 *
 * Да се направи функција која за даден број на чекори `n` и низа од вредности, ќе ги поместува елементите кои се наоѓаат во неа следејќи ги следните правила:
 *
 * - Доколку `n` е ПОЗИТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон десно, за онолку места колку што изнесува `n`.
 *
 * - Доколку `n` е НЕГАТИВЕН број, тогаш секој од елементите во низата треба да ја промени својата позиција кон лево, за онолку места колку што изнесува `n`.
 *
 * Пример:
 *  - n = 2, низата ['1', '2', '3'] треба да се претвори во ['2', '3', '1']
 *  - n = -3, низата ['1', '2', '3', '4', '5'] треба да се претвори во ['4', '5', '1', '2', '3']
 */
 function shiftNumbers(arr, n) {
    var arrLen = arr.length
    const leftSide = arr.slice(-n, arrLen)
    const righSide = arr.slice(0,-n)
    return leftSide.concat(righSide)
 }
{
    const sc2 = shiftNumbers([1,2,3], 2)
        console.log("sc2: " + sc2)
        //[2,3,1]
    const sc1 = shiftNumbers([1,2,3,4,5], -3)
        console.log("sc1: " + sc1)
        //[4,5,1,2,3]
}
        